Ran Plan for 6 projects:

1. dir: `nz3es/gcp/stg/data-plane/iac-01/global/network` workspace: `nz3es_gcp_stg_data-plane_iac-01_global_network`
1. dir: `nz3es/gcp/stg/data-plane/iac-01/global/dns-zone/iac-com` workspace: `nz3es_gcp_stg_data-plane_iac-01_global_dns-zone_iac-com`
1. dir: `nz3es/gcp/stg/data-plane/iac-01/australia-southeast2/service-connection-policy/valkey-psc` workspace: `nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_service-connection-policy_valkey-psc`
1. dir: `nz3es/gcp/stg/data-plane/iac-01/australia-southeast2/memorystore/volatile-lru` workspace: `nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_memorystore_volatile-lru`
1. dir: `nz3es/gcp/stg/data-plane/iac-01/global/dns-zone/iac-internal` workspace: `nz3es_gcp_stg_data-plane_iac-01_global_dns-zone_iac-internal`
1. dir: `nz3es/gcp/stg/data-plane/iac-01/australia-southeast2/secret/volatile-lru-ca-cert` workspace: `nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_secret_volatile-lru-ca-cert`
---

### 1. dir: `nz3es/gcp/stg/data-plane/iac-01/global/network` workspace: `nz3es_gcp_stg_data-plane_iac-01_global_network`
**Plan Failed**: This project is currently locked by an unapplied plan from pull #4. To continue, delete the lock from #4 or apply that plan and merge the pull request.

Once the lock is released, comment `atlantis plan` here to re-plan.

---
### 2. dir: `nz3es/gcp/stg/data-plane/iac-01/global/dns-zone/iac-com` workspace: `nz3es_gcp_stg_data-plane_iac-01_global_dns-zone_iac-com`
**Plan Failed**: This project is currently locked by an unapplied plan from pull #4. To continue, delete the lock from #4 or apply that plan and merge the pull request.

Once the lock is released, comment `atlantis plan` here to re-plan.

---
### 3. dir: `nz3es/gcp/stg/data-plane/iac-01/australia-southeast2/service-connection-policy/valkey-psc` workspace: `nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_service-connection-policy_valkey-psc`
<details><summary>Show Output</summary>

```diff
Removing TG cache from /home/atlantis/data/repos/esquare666/infra-as-code/5/nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_service-connection-policy_valkey-psc...
/home/atlantis/data/repos/esquare666/infra-as-code/5/nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_service-connection-policy_valkey-psc/modules/dns-zone/main.tf
/home/atlantis/data/repos/esquare666/infra-as-code/5/nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_service-connection-policy_valkey-psc/modules/dns-zone/outputs.tf
/home/atlantis/data/repos/esquare666/infra-as-code/5/nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_service-connection-policy_valkey-psc/modules/dns-zone/variables.tf
/home/atlantis/data/repos/esquare666/infra-as-code/5/nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_service-connection-policy_valkey-psc/modules/memorystore-valkey/main.tf
/home/atlantis/data/repos/esquare666/infra-as-code/5/nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_service-connection-policy_valkey-psc/modules/memorystore-valkey/outputs.tf
/home/atlantis/data/repos/esquare666/infra-as-code/5/nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_service-connection-policy_valkey-psc/modules/memorystore-valkey/variables.tf
/home/atlantis/data/repos/esquare666/infra-as-code/5/nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_service-connection-policy_valkey-psc/modules/secret-manager/main.tf
/home/atlantis/data/repos/esquare666/infra-as-code/5/nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_service-connection-policy_valkey-psc/modules/secret-manager/outputs.tf
/home/atlantis/data/repos/esquare666/infra-as-code/5/nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_service-connection-policy_valkey-psc/modules/secret-manager/variables.tf
/home/atlantis/data/repos/esquare666/infra-as-code/5/nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_service-connection-policy_valkey-psc/modules/service-connection-policy/main.tf
/home/atlantis/data/repos/esquare666/infra-as-code/5/nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_service-connection-policy_valkey-psc/modules/service-connection-policy/outputs.tf
/home/atlantis/data/repos/esquare666/infra-as-code/5/nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_service-connection-policy_valkey-psc/modules/service-connection-policy/variables.tf
/home/atlantis/data/repos/esquare666/infra-as-code/5/nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_service-connection-policy_valkey-psc/modules/vpc/main.tf
/home/atlantis/data/repos/esquare666/infra-as-code/5/nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_service-connection-policy_valkey-psc/modules/vpc/outputs.tf
/home/atlantis/data/repos/esquare666/infra-as-code/5/nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_service-connection-policy_valkey-psc/modules/vpc/variables.tf

07:25:50.700 WARN   The following strict control(s) are already completed: skip-dependencies-inputs. Please remove any completed strict controls, as setting them no longer does anything. For a list of all ongoing strict controls, and the outcomes of previous strict controls, see https://terragrunt.gruntwork.io/docs/reference/strict-mode or get the actual list by running the `terragrunt info strict` command.
07:25:51.467 INFO   Downloading Terraform configurations from ../../../../../../../../modules/service-connection-policy into ./.terragrunt-cache/JHnwArN4uhtnxvY0b8AGmJWgmPE/ghQYBiw_46nvReGWXzo3R28a18g
07:25:51.546 INFO   terraform1.13.3: Initializing the backend...
07:25:52.514 INFO   terraform1.13.3: 
07:25:52.514 INFO   terraform1.13.3: Successfully configured the backend "gcs"! Terraform will automatically
07:25:52.514 INFO   terraform1.13.3: use this backend unless the backend configuration changes.
07:25:53.128 INFO   terraform1.13.3: Initializing provider plugins...
07:25:53.128 INFO   terraform1.13.3: - Finding hashicorp/google versions matching ">= 6.0.0"...
07:25:53.498 INFO   terraform1.13.3: - Using hashicorp/google v7.17.0 from the shared cache directory
07:25:55.197 INFO   terraform1.13.3: Terraform has created a lock file .terraform.lock.hcl to record the provider
07:25:55.197 INFO   terraform1.13.3: selections it made above. Include this file in your version control repository
07:25:55.197 INFO   terraform1.13.3: so that Terraform can guarantee to make the same selections by default when
07:25:55.197 INFO   terraform1.13.3: you run "terraform init" in the future.
07:25:55.199 INFO   terraform1.13.3: ╷
07:25:55.199 INFO   terraform1.13.3: │ Warning: Incomplete lock file information for providers
07:25:55.199 INFO   terraform1.13.3: │ 
07:25:55.199 INFO   terraform1.13.3: │ Due to your customized provider installation methods, Terraform was forced
07:25:55.199 INFO   terraform1.13.3: │ to calculate lock file checksums locally for the following providers:
07:25:55.199 INFO   terraform1.13.3: │   - hashicorp/google
07:25:55.199 INFO   terraform1.13.3: │ 
07:25:55.199 INFO   terraform1.13.3: │ The current .terraform.lock.hcl file only includes checksums for
07:25:55.200 INFO   terraform1.13.3: │ linux_amd64, so Terraform running on another platform will fail to install
07:25:55.200 INFO   terraform1.13.3: │ these providers.
07:25:55.200 INFO   terraform1.13.3: │ 
07:25:55.200 INFO   terraform1.13.3: │ To calculate additional checksums for another platform, run:
07:25:55.200 INFO   terraform1.13.3: │   terraform providers lock -platform=linux_amd64
07:25:55.200 INFO   terraform1.13.3: │ (where linux_amd64 is the platform to generate)
07:25:55.201 INFO   terraform1.13.3: ╵
07:25:55.201 INFO   terraform1.13.3: Terraform has been successfully initialized!
07:25:59.047 STDOUT terraform1.13.3: Terraform used the selected providers to generate the following execution
07:25:59.047 STDOUT terraform1.13.3: plan. Resource actions are indicated with the following symbols:
07:25:59.047 STDOUT terraform1.13.3:   + create
07:25:59.047 STDOUT terraform1.13.3: Terraform will perform the following actions:
07:25:59.047 STDOUT terraform1.13.3:   # google_network_connectivity_service_connection_policy.policy["valkey-psc"] will be created
07:25:59.048 STDOUT terraform1.13.3:   + resource "google_network_connectivity_service_connection_policy" "policy" {
07:25:59.048 STDOUT terraform1.13.3:       + create_time      = (known after apply)
07:25:59.048 STDOUT terraform1.13.3:       + effective_labels = {
07:25:59.048 STDOUT terraform1.13.3:           + "goog-terraform-provisioned" = "true"
07:25:59.048 STDOUT terraform1.13.3:         }
07:25:59.048 STDOUT terraform1.13.3:       + etag             = (known after apply)
07:25:59.049 STDOUT terraform1.13.3:       + id               = (known after apply)
07:25:59.049 STDOUT terraform1.13.3:       + infrastructure   = (known after apply)
07:25:59.049 STDOUT terraform1.13.3:       + location         = "australia-southeast2"
07:25:59.049 STDOUT terraform1.13.3:       + name             = "valkey-psc"
07:25:59.049 STDOUT terraform1.13.3:       + network          = "projects/iac-01/global/networks/stg-iac-01"
07:25:59.049 STDOUT terraform1.13.3:       + project          = "iac-01"
07:25:59.049 STDOUT terraform1.13.3:       + psc_connections  = (known after apply)
07:25:59.050 STDOUT terraform1.13.3:       + service_class    = "gcp-memorystore"
07:25:59.050 STDOUT terraform1.13.3:       + terraform_labels = {
07:25:59.050 STDOUT terraform1.13.3:           + "goog-terraform-provisioned" = "true"
07:25:59.050 STDOUT terraform1.13.3:         }
07:25:59.050 STDOUT terraform1.13.3:       + update_time      = (known after apply)
07:25:59.050 STDOUT terraform1.13.3:       + psc_config {
07:25:59.050 STDOUT terraform1.13.3:           + producer_instance_location = (known after apply)
07:25:59.050 STDOUT terraform1.13.3:           + subnetworks                = [
07:25:59.051 STDOUT terraform1.13.3:               + "projects/iac-01/regions/australia-southeast2/subnetworks/ause2",
07:25:59.051 STDOUT terraform1.13.3:             ]
07:25:59.051 STDOUT terraform1.13.3:         }
07:25:59.051 STDOUT terraform1.13.3:     }
07:25:59.051 STDOUT terraform1.13.3:   # google_project_service.networkconnectivity will be created
07:25:59.051 STDOUT terraform1.13.3:   + resource "google_project_service" "networkconnectivity" {
07:25:59.051 STDOUT terraform1.13.3:       + disable_on_destroy = false
07:25:59.051 STDOUT terraform1.13.3:       + id                 = (known after apply)
07:25:59.052 STDOUT terraform1.13.3:       + project            = "iac-01"
07:25:59.052 STDOUT terraform1.13.3:       + service            = "networkconnectivity.googleapis.com"
07:25:59.052 STDOUT terraform1.13.3:     }
07:25:59.052 STDOUT terraform1.13.3: Plan: 2 to add, 0 to change, 0 to destroy.
07:25:59.052 STDOUT terraform1.13.3: 
07:25:59.052 STDOUT terraform1.13.3: Changes to Outputs:
07:25:59.052 STDOUT terraform1.13.3:   + policies   = {
07:25:59.052 STDOUT terraform1.13.3:       + valkey-psc = {
07:25:59.052 STDOUT terraform1.13.3:           + create_time      = (known after apply)
07:25:59.052 STDOUT terraform1.13.3:           + description      = null
07:25:59.053 STDOUT terraform1.13.3:           + effective_labels = {
07:25:59.053 STDOUT terraform1.13.3:               + goog-terraform-provisioned = "true"
07:25:59.053 STDOUT terraform1.13.3:             }
07:25:59.053 STDOUT terraform1.13.3:           + etag             = (known after apply)
07:25:59.053 STDOUT terraform1.13.3:           + id               = (known after apply)
07:25:59.053 STDOUT terraform1.13.3:           + infrastructure   = (known after apply)
07:25:59.053 STDOUT terraform1.13.3:           + labels           = null
07:25:59.053 STDOUT terraform1.13.3:           + location         = "australia-southeast2"
07:25:59.054 STDOUT terraform1.13.3:           + name             = "valkey-psc"
07:25:59.054 STDOUT terraform1.13.3:           + network          = "projects/iac-01/global/networks/stg-iac-01"
07:25:59.054 STDOUT terraform1.13.3:           + project          = "iac-01"
07:25:59.054 STDOUT terraform1.13.3:           + psc_config       = [
07:25:59.054 STDOUT terraform1.13.3:               + {
07:25:59.054 STDOUT terraform1.13.3:                   + allowed_google_producers_resource_hierarchy_level = null
07:25:59.054 STDOUT terraform1.13.3:                   + limit                                             = null
07:25:59.055 STDOUT terraform1.13.3:                   + producer_instance_location                        = (known after apply)
07:25:59.055 STDOUT terraform1.13.3:                   + subnetworks                                       = [
07:25:59.055 STDOUT terraform1.13.3:                       + "projects/iac-01/regions/australia-southeast2/subnetworks/ause2",
07:25:59.055 STDOUT terraform1.13.3:                     ]
07:25:59.055 STDOUT terraform1.13.3:                 },
07:25:59.055 STDOUT terraform1.13.3:             ]
07:25:59.055 STDOUT terraform1.13.3:           + psc_connections  = (known after apply)
07:25:59.056 STDOUT terraform1.13.3:           + service_class    = "gcp-memorystore"
07:25:59.056 STDOUT terraform1.13.3:           + terraform_labels = {
07:25:59.056 STDOUT terraform1.13.3:               + goog-terraform-provisioned = "true"
07:25:59.056 STDOUT terraform1.13.3:             }
07:25:59.056 STDOUT terraform1.13.3:           + timeouts         = null
07:25:59.056 STDOUT terraform1.13.3:           + update_time      = (known after apply)
07:25:59.056 STDOUT terraform1.13.3:         }
07:25:59.056 STDOUT terraform1.13.3:     }
07:25:59.056 STDOUT terraform1.13.3:   + policy_ids = {
07:25:59.056 STDOUT terraform1.13.3:       + valkey-psc = (known after apply)
07:25:59.056 STDOUT terraform1.13.3:     }
```
</details>

* :arrow_forward: To **apply** this plan, comment:
  ```shell
  atlantis apply -d nz3es/gcp/stg/data-plane/iac-01/australia-southeast2/service-connection-policy/valkey-psc -w nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_service-connection-policy_valkey-psc
  ```
* :put_litter_in_its_place: To **delete** this plan and lock, click [here](https://www.3es.nz/lock?id=esquare666%252Finfra-as-code%252Fnz3es%252Fgcp%252Fstg%252Fdata-plane%252Fiac-01%252Faustralia-southeast2%252Fservice-connection-policy%252Fvalkey-psc%252Fnz3es_gcp_stg_data-plane_iac-01_australia-southeast2_service-connection-policy_valkey-psc)
* :repeat: To **plan** this project again, comment:
  ```shell
  atlantis plan -d nz3es/gcp/stg/data-plane/iac-01/australia-southeast2/service-connection-policy/valkey-psc -w nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_service-connection-policy_valkey-psc
  ```
Plan: 2 to add, 0 to change, 0 to destroy.

---
### 4. dir: `nz3es/gcp/stg/data-plane/iac-01/australia-southeast2/memorystore/volatile-lru` workspace: `nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_memorystore_volatile-lru`
**Plan Failed**: This project is currently locked by an unapplied plan from pull #4. To continue, delete the lock from #4 or apply that plan and merge the pull request.

Once the lock is released, comment `atlantis plan` here to re-plan.

---
### 5. dir: `nz3es/gcp/stg/data-plane/iac-01/global/dns-zone/iac-internal` workspace: `nz3es_gcp_stg_data-plane_iac-01_global_dns-zone_iac-internal`
**Plan Failed**: This project is currently locked by an unapplied plan from pull #4. To continue, delete the lock from #4 or apply that plan and merge the pull request.

Once the lock is released, comment `atlantis plan` here to re-plan.

---
### 6. dir: `nz3es/gcp/stg/data-plane/iac-01/australia-southeast2/secret/volatile-lru-ca-cert` workspace: `nz3es_gcp_stg_data-plane_iac-01_australia-southeast2_secret_volatile-lru-ca-cert`
**Plan Failed**: This project is currently locked by an unapplied plan from pull #4. To continue, delete the lock from #4 or apply that plan and merge the pull request.

Once the lock is released, comment `atlantis plan` here to re-plan.

---
### Plan Summary

6 projects, 1 with changes, 0 with no changes, 5 failed

* :fast_forward: To **apply** all unapplied plans from this Pull Request, comment:
  ```shell
  atlantis apply
  ```
* :put_litter_in_its_place: To **delete** all plans and locks from this Pull Request, comment:
  ```shell
  atlantis unlock
  ```